#include "stdafx.h"
//#include <string.h>
#include "diksamc.h"

ErrorDefinition dkc_error_message_format[] = {
	{ "dummy\n" },
	{ "在($(token))附近发生语法错误\n" },
	{ "不正确的字符($(bad_char))\n" },
	{ "函数名重复($(name))\n" },
	{ "不正确的多字节字符。\n" },
	{ "预期外的宽字符串。\n" },
	{ "数组元素不能标识为final。\n" },
	{ "复合赋值运算符不能用于final值\n" },
	{ "函数的参数名重复($(name))。\n" },
	{ "变量名$(name)重复。\n" },
	{ "找不到变量或函数$(name)。\n" },
	{ "$(name)是函数名，但没有函数调用的()。\n" },
	{ "不能强制转型为派生类型。\n" },
	{ "不能将$(src)转型为$(dest)。\n" },
	{ "算数运算符的操作数类型不正确。\n" },
	{ "比较运算符的操作数类型不正确。\n" },
	{ "逻辑and/or运算符的操作数类型不正确。\n" },
	{ "减法运算符的操作数类型不正确。\n" },
	{ "逻辑非运算符的操作数类型不正确。\n" },
	{ "自增/自减运算符的操作数类型不正确。\n" },
	{ "函数调用运算符的操作数不是函数名。\n" },
	{ "找不到函数$(name)。\n" },
	{ "函数的参数数量错误。\n" },
	{ "赋值运算符的左边不是一个左边值。\n" },
	{ "标签$(label)不存在。\n" },
	{ "数组字面量必须至少有一个元素。\n" },
	{ "下标运算符[]的左边不是数组类型。\n" },
	{ "数组的下标不是int。\n" },
	{ "数组的大小不是int。\n" },
	{ "整数值不能被0除。\n" },
	{ "dummy\n" }
};